#ifndef	__ELUDE_H
#define __ELUDE_H

#include "stm32f10x.h"


// S_Elude_Infrared_Input的低三位分别对应[PA3、PA2、PA1]的状态值
// 未遇到障碍(未接收到红外光)：对应状态 = 1
// 遇到障碍(接收到红外光)：对应状态 = 0
//--------------------------------------------------------------
//extern u8 S_Elude_Input ;		// 寻迹模块的返回值
//--------------------------------------------------------------


// 红外避障情况
//-----------------------------------------------------------------
#define		Not_Find_Barrier			0x01	// 未发现障碍
#define		Find_Barrier			0x00	// 发现障碍
//-----------------------------------------------------------------


void Elude_Input_Init_JX(void);		// 红外避障初始化

u8 Elude_detect_barrier(void);	// 红外避障检测函数

#endif	/* __ELUDE_H*/

